practice-for-ch-js-ajax-twitter-long-practice/app/controllers/follows_controller.rb

INSERT INTO "follows" ("follower_id", "following_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["following_id", 2], ["created_at", "2023-03-29 21:35:07.911338"], ["updated_at", "2023-03-29 21:35:07.911338"]]
---
  def create
    # simulate latency
    sleep(1)

    follow = current_user.out_follows.create!(following_id: params[:user_id])

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]
---
  def destroy
    # simulate latency
    sleep(1)

    follow = current_user.out_follows.find_by(following_id: params[:user_id])
    follow.destroy!